apps/relay/artillery.yml
config:
  # target: "ws://127.0.0.1:3000"
  # target: "wss://relay.nostr.info"
  processor: "./artillery-test.js"
  target: "wss://relay.futohq.com"
  phases:
    - duration: 1
      arrivalRate: 1
  ws:
    subprotocols:
      - json
scenarios:
  - engine: ws
    name: Dummy request with timestamp as subid
    flow:
      - function: "createSubscriptionRequest"
      - send: "{{ data }}"