apps/relay/artillery.yml
config:
  # target: "ws://127.0.0.1:3000"
  target: "wss://relay.nostr.info"
  phases:
    - duration: 20
      arrivalRate: 10
  ws:
    subprotocols:
      - json
scenarios:
  - engine: ws
    name: Request stuff but with subscription ID
    flow:
      - send: '["REQ","011593081935073135",{"kinds":[0,1,4,40,41,42]}]'